/*Лесные эльфы расположили свою деревню в лесу, прямо на деревьях. Нужно
расселить эльфов по веткам деревьев, а затем подсчитать общее количество соседей
определённого эльфа. Всего в лесу пять деревьев, каждое из которых генерируется
с помощью случайных чисел, заданных в указанных далее диапазонах. На каждом
дереве есть 3–5 основных больших ветвей. На каждой большой ветке расположены ещё
2-3 средние ветки. Дома эльфов построены на больших и на средних ветках. Более
мелкие ветви не рассматриваются в этой задаче. В начале программы пользователь
размещает в каждом доме по одному эльфу. Делается это с помощью
последовательного перебора всех имеющихся домов и запроса имени заселяемого
эльфа через стандартный ввод. Если было введено None в качестве имени, то дом
пропускается и не заселяется никем. После этого требуется найти определённого
эльфа по имени. Имя искомого эльфа вводится через стандартный ввод. Для
найденного эльфа нужно вывести общее количество эльфов, живущих вместе с ним на
одной большой ветви. Это и будет искомое количество соседей.*/

#include "branch.h"
#include "elf.h"
#include "forest.h"
#include <ctime>
#include <iostream>

int main() {
  std::srand(std::time(nullptr));

  Forest forest;

  forest.settleElves(true);
  forest.view();

  std::string name;

  std::cout << "Enter elf name to search > ";
  std::cin >> name;

  Elf *elf = forest.findElf(name);

  if (elf != nullptr)
    std::cout << "The elf has been found. Number of neighbors "
              << elf->countNeighbors();
  else
    std::cout << "Elf with that name not found";

  return 0;
}
